Repository: chabulhwi/math-notes
Catalog: omegat/omegat-level2.tmx
Source language: ko
Languages: en

source: $ \forall x \left \mathrm{class} \ x \rightarrow \left ( x \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ x \wedge x \notin x \right ) \right $ (3, 정확한 치환)
en: $ \forall x \left \mathrm{class} \ x \rightarrow \left ( x \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ x \wedge x \notin x \right ) \right $ (3, Proper substitution)

source: $ \forall x \left [ \mathrm{class} \ x \rightarrow \left ( x \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ x \wedge \left x / y \right y \notin y \right ) \right ] $ (2, 1, 정의 4.3)
en: $ \forall x \left [ \mathrm{class} \ x \rightarrow \left ( x \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ x \wedge \left x / y \right y \notin y \right ) \right ] $ (2, 1, Definition 4.3)

source: $ \left x / y \right \varphi $는 잘세운식 $ \varphi $에 있는 변수 $ y $를 변수 $ x $로 정확히 바꿔 얻은 잘세운식이다.
en: $ \left x / y \right \varphi $ is the wff that results from the proper substitution of $ y $ for $ x $ in the wff $ \varphi $.

# $ mathrm{Ru} = left { y middle| y otin y ight } $ (1, 정의 5.2)
source: $ \mathrm{Ru} = \left \{ y \ \middle| \ y \notin y \right \} $ (1, 정의 5.2)
en: $ \mathrm{Ru} = \left \{ y \ \middle| \ y \notin y \right \} $ (1, Definition 5.2)

source: $ \mathrm{Ru} \in \mathrm{Ru} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} $ (9, 8, 전건 긍정 논법)
en: $ \mathrm{Ru} \in \mathrm{Ru} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} $ (9, 8, Modus ponens)

source: $ \mathrm{Ru} \notin \mathrm{Ru} \wedge \neg \mathrm{set} \ \mathrm{Ru} $ (10, 논리곱과 쌍조건문의 정의)
en: $ \mathrm{Ru} \notin \mathrm{Ru} \wedge \neg \mathrm{set} \ \mathrm{Ru} $ (10, Definitions of conjunction and logical equivalence)

source: $ \mathrm{class} \ A $는 "$ A $는 부류class이다."라는 뜻의 잘세운식이다.
en: $ \mathrm{class} \ A $ is a wff that means "$ A $ is a class."

# $ mathrm{class} left { y middle| y otin y ight } $ (2, 1, 정의 4.2)
source: $ \mathrm{class} \ \left \{ y \ \middle| \ y \notin y \right \} $ (2, 1, 정의 4.2)
en: $ \mathrm{class} \ \left \{ y \ \middle| \ y \notin y \right \} $ (2, 1, Definition 4.2)

source: $ \mathrm{class} \ \mathrm{Ru} $ (4, 3, $ = $ 다시 쓰기)
en: $ \mathrm{class} \ \mathrm{Ru} $ (4, 3, $ = $-rewriting)

source: $ \mathrm{class} \ \mathrm{Ru} $ (따름 정리 5.3)
en: $ \mathrm{class} \ \mathrm{Ru} $ (Lemma 5.3)

source: $ \mathrm{class} \ \mathrm{Ru} \rightarrow \left ( \mathrm{Ru} \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} \right ) $ (5, 4, $ \forall $ 제거)
en: $ \mathrm{class} \ \mathrm{Ru} \rightarrow \left ( \mathrm{Ru} \in \left \{ y \ \middle| \ y \notin y \right \} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} \right ) $ (5, 4, $ \forall $-elimination)

source: $ \mathrm{class} \ \mathrm{Ru} \rightarrow \left ( \mathrm{Ru} \in \mathrm{Ru} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} \right ) $ (7, 6, $ = $ 다시 쓰기)
en: $ \mathrm{class} \ \mathrm{Ru} \rightarrow \left ( \mathrm{Ru} \in \mathrm{Ru} \leftrightarrow \mathrm{set} \ \mathrm{Ru} \wedge \mathrm{Ru} \notin \mathrm{Ru} \right ) $ (7, 6, $ = $-rewriting)

source: $ \mathrm{set} \ a $는 "$ a $는 집합이다."라는 뜻의 잘세운식이다.
en: $ \mathrm{set} \ a $ is a wff that means "$ a $ is a set."

source: $ \mathrm{term} \ \mathrm{Ru} $ (구문 5.1)
en: $ \mathrm{term} \ \mathrm{Ru} $ (Syntax 5.1)

source: $ \mathrm{term} \ x $는 "$ x $는 항이다."라는 뜻의 진술이다.
en: $ \mathrm{term} \ x $ is a statement that means "$ x $ is a term."

source: $ \mathrm{var} \ x $는 "$ x $는 변수이다."라는 뜻의 진술이다.
en: $ \mathrm{var} \ x $ is a statement that means "$ x $ is a variable."

source: $ \mathrm{var} \ x \ y $ (메타변수 유형 가정)
en: $ \mathrm{var} \ x \ y $ (Metavariable-type hypothesis)

source: $ \mathrm{var} \ x \ y $는 "$ x $와 $ y $는 변수이다."라는 뜻의 진술이다.
en: $ \mathrm{var} \ x \ y $ is a statement that means "$ x $ and $ y $ are variables."

source: $ \mathrm{var} \ y $ (메타변수 유형 가정)
en: $ \mathrm{var} \ y $ (Metavariable-type hypothesis)

source: $ \mathrm{wff} \ \varphi $는 "$ \varphi $는 잘세운식well-formed formula, wff이다."라는 뜻의 진술이다.
en: $ \mathrm{wff} \ \varphi $ is a statement that means "$ \varphi $ is a wff (well-formed formula)."

# $ mathrm{wff} y otin y $ (1, 공리적 집합론의 구문)
source: $ \mathrm{wff} \ y \notin y $ (1, 공리적 집합론의 구문)
en: $ \mathrm{wff} \ y \notin y $ (1, The syntax of axiomatic set theory)

source: $ \varphi $와 $ \psi $가 잘세운식이라고 하자.
en: Let $ \varphi $ and $ \psi $ be wffs.

source: $ \varphi \leftrightarrow \psi \wedge \neg \varphi $가 참이면 $ \neg \varphi \wedge \neg \psi $ 또한 참이다.
en: If $ \varphi \leftrightarrow \psi \wedge \neg \varphi $ is true, then $ \neg \varphi \wedge \neg \psi $ is also true.

source: 구문 1 변수
en: Syntax 1 Variables

source: 구문 2 집합
en: Syntax 2 Sets

source: 구문 3 부류
en: Syntax 3 Classes

source: 구문 4.1 부류 추상화 (1)
en: Syntax 4.1 Class Abstraction (1)

source: 구문 5.1 러셀 부류 (1)
en: Syntax 5.1 The Russell Class (1)

source: 따름 정리 5.3 러셀 부류 (3)
en: Lemma 5.3 The Russell Class (3)

source: 정리 6 러셀의 역설
en: Theorem 6 Russell's Paradox

source: 정의 4.2 부류 추상화 (2)
en: Definition 4.2 Class Abstraction (2)

source: 정의 4.3 부류 추상화 (3)
en: Definition 4.3 Class Abstraction (3)

source: 정의 5.2 러셀 부류 (2)
en: Definition 5.2 The Russell Class (2)

source: Takeuti and Zaring 1982, chap.
en: Cf. Takeuti and Zaring 1982, chap.

source: 가정
en: Hypotheses

source: 따라서 러셀 부류는 그 자신의 원소가 아니다.
en: Therefore, the Russell class is not an element of itself.

source: 러셀 부류는 부류이다.
en: The Russell class is a class.

source: 러셀 부류는 진부류이다.
en: The Russell class is a proper class.

source: 러셀 부류는 집합이 아니므로 어떤 부류의 원소도 될 수 없다.
en: Since the Russell class is not a set, it is not an element of any classes.

source: 러셀 부류란, 자신을 원소로 갖지 않는 모든 집합의 부류이다.
en: The Russell class is the class of all sets that are not members of themselves.

source: 모든 집합은 부류이다.
en: All sets are classes.

source: 부류의 정의
en: A Definition of Classes

source: 붙임
en: Remarks

source: 여기에서는 그 증명을 생략하겠다.
en: We omit the proof here.

source: 이 구문은 $ A $가 항이면 $ \mathrm{class} \ A $가 잘세운식임을 뜻한다.
en: This syntax means that if $ A $ is a term, then $ \mathrm{class} \ A $ is a wff.

source: 이 구문은 $ a $가 항이면 $ \mathrm{set} \ a $가 잘세운식임을 뜻한다.
en: This syntax means that if $ a $ is a term, then $ \mathrm{set} \ a $ is a wff.

source: 이 구문은 러셀 부류가 항임을 뜻한다.
en: This syntax means that the Russell class is a term.

source: 이 구문은 변수가 항을 나타냄을 뜻한다.
en: This syntax means that a variable denotes a term.

source: 이 구문은 부류 추상화class abstraction가 항임을 뜻한다.
en: This syntax means that a class abstraction is a term.

source: 이 정의는 부류 추상화가 부류임을 뜻한다.
en: This definition means that a class abstraction is a class.

source: 이는 논리곱과 쌍조건문의 정의에 따른 결과이며, 위의 증명의 11단계에서 이용됐다.
en: This is a result of the definitions of conjunction and logical equivalence, and is used in Step 11 of the above proof.

source: 이런 치환을 정확한 치환proper substitution이라고 한다.
en: That is, $ y $ properly replaces $ x $.

source: 주장
en: Assertion

source: 증명
en: Proof

source: 집합이 아닌 부류를 진부류proper class라고 한다.
en: A proper class is a class that is not a set.

source: 참고 문헌
en: References
